boundaryCondition/inletOutlet/system/snappyHexMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

castellatedMesh on;
snap            on;
addLayers       off;

geometry
{
    cylinder.stl
    {
        type triSurfaceMesh;
        name cylinder;
    }
}

castellatedMeshControls
{
            //----- do not touch
            maxLocalCells 100000;

            maxGlobalCells 2000000;
            
            minRefinementCells 0;
            
            maxLoadUnbalance 0.10;
            
            nCellsBetweenLevels 1;
            
            resolveFeatureAngle 30;

            planarAngle 30;
            
            allowFreeStandingZoneFaces true;
            //----- 
    
    features
    (
        {
            file "cylinder.eMesh";
            level 0;
        }

    );

    refinementSurfaces
    {
        cylinder
        {
            level (0 0);
            //level (1 1);
            patchInfo { type wall; }
        }
    }

    refinementRegions
    {
    }

    //locationInMesh (0 0 0.5);
    locationInMesh (0 0 1.5);
    
    
    
}

snapControls
{
            //----- do not touch
            nSmoothPatch 3;
             
            tolerance 2.0;

            nSolveIter 30;

            nRelaxIter 5;

            // Feature snapping
            
                nFeatureSnapIter 10;
                
                implicitFeatureSnap false;
                
                explicitFeatureSnap true;
                
                multiRegionFeatureSnap false;
            //-----
}

meshQualityControls
{
            //----- do not touch
            #include "meshQualityDict"

            relaxed
            {
                maxNonOrtho 75;
            }
            
            nSmoothScale 4;
                
            errorReduction 0.75;
            //-----
}


addLayersControls
{
            //----- do not touch
            layers
            {
            }

            relativeSizes       true;
            expansionRatio      1.2;
            finalLayerThickness 0.5;
            minThickness        1e-3;
            //-----
}


writeFlags
(
);

mergeTolerance 1e-6;


// ************************************************************************* //
